class OBlock:
    def __init__(self):
        # 色は黄色です
        # クラスの中にcolorという変数を作って黄色を入れておきます
        """この行を消して書いてみてください"""
    
    # Boardからカーソルをもらってブロックの情報を計算して
    # Boardに描画するための座標リストを返します
    def block_info(self, cursor):
        # 最初はどうなるかわからないので[]を入れておきます
        # 後から座標を入れて、最後に返すようにします
        # 普通の変数resultに[]を入れましょう
        """この行を消して書いてみてください"""

        # カーソルの座標を取得します
        # カーソルの座標はcursor.xとcursor.yで取得できます
        # それを変数に入れておきます
        x = """上に書いた通り"""
        y = """上に書いた通り"""

        # 4つの座標を計算します
        # まずは左上の座標です
        # これはカーソルの座標そのままです
        # 座標は(x座標, y座標)の形でリストに入れます
        """10行目くらいに作った変数名""".append((x, y))

        # 次に右上の座標です
        # これは左上の座標から右に1つ進んだ座標です
        # x座標を1つ増やしてy座標はそのままです
        # リストに入れます
        """10行目くらいに作った変数名""".append("""ここを書いてみてください""")

        # 次に左下の座標です
        # これは左上の座標から下に1つ進んだ座標です
        # x座標はそのままでy座標を1つ増やします
        # リストに入れます
        """10行目くらいに作った変数名""".append("""ここを書いてみてください""")

        # 最後に右下の座標です
        # これは左上の座標から右に1つ進んで下に1つ進んだ座標です
        # x座標を1つ増やしてy座標も1つ増やします
        # リストに入れます
        """10行目くらいに作った変数名""".append("""ここを書いてみてください""")

        # 4つの座標が入ったリストを返します
        return """10行目くらいに作った変数名"""
    
    # クラスの中に回転する関数を作ってみます
    # 今回は回転しないので何も書きませんが、作り方だけ復習
    # rotateという関数を作ります
    # 関数の中身は...としておきます
    """3.4を参考にしてください"""